Revit 2027 API
DatumPlane.Maximize3DExtents Method
 Computes the 3d extents of all model geometry and levels, and extends the 3d extents of this datum surface to include the model extents.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Maximize3DExtents()
Public Sub Maximize3DExtents
public:
void Maximize3DExtents()
member Maximize3DExtents : unit -> unit
Remarks
 Currently does not apply to curved grids.
See Also
Reference
DatumPlane Class
Autodesk.Revit.DB Namespace